In [9]:
import pandas as pd

In [14]:
df=pd.read_csv("/Users/jerry/Desktop/messy_data.csv")

In [15]:
df

     Age       Income  Gender Product  Quantity
0     56  59544.57663  Female       D         3
1     46  36399.18997  Female     NaN         1
2     32  57140.63881  Female       D         2
3     60  69554.91903    Male       C         5
4     25  53173.80518  Female       D         2
..   ...          ...     ...     ...       ...
100   61  37341.55459    Male       D         5
101   55  35516.63492  Female       A         3
102   31  53254.05089    Male       B         2
103   21          NaN    Male       B         2
104   60  69554.91903    Male       C         5

[105 rows x 5 columns]

In [16]:
df.groupby('Gender')['Income'].mean()

Gender
Female    49644.486259
Male      57219.421148
Name: Income, dtype: float64

In [ ]:
#average income by product

In [17]:
df.groupby('Product')['Income'].mean()

Product
A    51745.423588
B    61486.730790
C    50857.602438
D    49876.379810
Name: Income, dtype: float64

In [18]:
#HOW MANY CUSTOMERS PURCHASE EACH INCOME

In [19]:
df.groupby('Product')['Age'].count()

Product
A    23
B    25
C    24
D    28
Name: Age, dtype: int64

In [25]:
df['Product'].value_counts()

Product
D    28
B    25
C    24
A    23
Name: count, dtype: int64

In [26]:
#Find min, max, mean,median of income column

In [27]:
df['Income'].describe()

count        94.000000
mean      52867.862808
std       29896.579420
min       20901.331720
25%       37814.315255
50%       48760.369705
75%       61644.277868
max      300000.000000
Name: Income, dtype: float64

In [29]:
#find descriptive stats income by gender
df.groupby('Gender')['Income'].describe()

,count,mean,std,min,25%,50%,75%,max
Gender,,,,,,,,
Female,54.0,49644.486259,15220.366090,27763.63630,37549.629215,47443.734975,59180.209903,94154.95125
Male,40.0,57219.421148,42222.682325,20901.33172,38144.018710,52807.321410,63330.314347,300000.00000